lib/tasks/sync_products.rake

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."name" = $1 AND "products"."description" = $2 AND "products"."price" = $3 LIMIT $4
---
    task fetch: :environment do
      api = FakeStoreApi.new
      products = api.fetch_products.parsed_response

      products.each do |product_data|
        Product.find_or_create_by(
          name: product_data['title'],
          description: product_data['description'],
          price: product_data['price']
        )