app/controllers/discount_campaigns_controller.rb

  def index
    @discount_campaigns = DiscountCampaign.all
---
SELECT "discount_campaigns".* FROM "discount_campaigns"